//val name String='Hackaton Survival' //Название мероприятия
//
//var date String=9.10.2024 //Дата проведения
//
//val place String=Sochi //Место проведения
//
//private val budget String =  5000"" //Подробный бюджет мероприятия, включая расходы на оборудование, кейтеринг и другие операционные расходы.
//
//var number: Int = 0 //Количество участников
//    get() = field
//    private set(value) {field=value}
//
//var duration: Long = 8*60*60 //Длительность хакатона
//
//private lateinit var contractinformation: String //Контактная информация и условия соглашений с поставщиками пищи, оборудования и других услуг.
//
//var status: String = "не начат" //Текущее состояние хакатона (статус)
//
//val sponsors: String = "список спонсоров" //Список спонсоров
//
//var internetAccessLevel: Int = 0 //Текущий уровень доступа к интернету
//
//val mood: String by lazy { "" }
//
//private var information: String = "информация о транспортировке"
//
//lateinit var plan: String
//
//var numberofteams: Int = 0 //Количество команд
//
//val tasks: String = "Задачи"
//
//val evacuationplan: String = "План Эвакуации" //План эвакуации
//
//var listofavailableequipment: String " " //Список доступного оборудования
//
//var listoffreeequipment: String = "50" //Список доступного оборудования
//
//val urgentplan: String = "План мероприятий на случай сбоя" //План мероприятий на случай сбоев
//
//val feedback: String by lazy { "" } //анонимные вопросы
//
//var listofexpertsandjury: String " " //Список экспертов и жюри
////Методы и процедуры для сбора отзывов от участников и гостей, включая анонимные опросы и интервью.
//var privacypolitics: String = //Политика конфиденциальности
//    private var anonymousfeedback: String by lazy {""} // Приватные отзывы (фидбэк) участников и зрителей для анализа проблем.
//почему ошибка?
//
//var temperature String= "" //Текущая температура в помещении
//
////Мониторинг и анализ производительности сетевого оборудования и интернет-соединения.\
//var lightlevel String= "" //Уровень освещения
//
//var eventlog String= ""//Лог событий мероприятия
//
////Доступность медицинской помощи
//
//val plans: String = "Планы и процедуры для обеспечения безопасности мероприятия, включая планы эвакуации и протоколы чрезвычайных ситуаций"
//
//val regnumber String= "Регистрационный номер"//Регистрационный номер мероприятия"
//
////Максимально допустимый уровень шума в помещении хакатона.
////Индикатор превышения уровня шума в помещениях
////Формат мероприятия (зависит от геополитической обстановки)
////Количество свободных мест для отдыха (например, кресел или диванов), сеттер валидирует, чтобы количество не было меньше нуля.
////План взаимодействия с прессой
////Детальная информация о проектах каждой команды, сбор данных включает в себя компиляцию кода и сбор статистики прогона автоматизированных проверок.
////Статус получения всех необходимых разрешений
////Указывает, открыт ли доступ к эксклюзивным ресурсам (например, специальному оборудованию)
////Список партнеров мероприятия
////Отчет, включающий фотографии, видео и отзывы, генерируется и становится доступен после завершения мероприятия.
////План распределения призов
////Контактная информация экстренных служб, медицинского персонала и других важных служб, недоступная участникам.
////Особые условия для участников с ограниченными возможностями
////Общее настроение участников (определяется опросами)
////Подробный план хакатона, включающий время и содержание каждого сегмента, инициализируется непосредственно перед началом мероприятия.
//lateinit var plan: String "имя" //Имя знаменитого специального гостя, которое будет объявлено за день до мероприятия.
//var maxpeopleamount String=
//var duration: Long = //Стандартное количество часов, отведенное каждой команде для работы над проектом.